In [1]:
import pandas as pd

### Download the data and load it to Pandas. 

You can find the data files in the README.

In [2]:
titles = pd.read_csv('imdb_pandas/titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [3]:
cast = pd.read_csv('imdb_pandas/cast.csv')
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### Using groupby(), count the number of films that have been released in each decade in the history of cinema.

In [4]:
titles.assign(decade = titles['year'] // 10 * 10).groupby('decade').size()

decade
1890        3
1900       37
1910     6512
1920     8797
1930    10097
1940     8576
1950    12711
1960    17515
1970    18714
1980    20243
1990    22225
2000    38713
2010    67977
2020      210
dtype: int64

### Use groupby() count the number of "Hamlet" films made in each decade.

In [5]:
titles[titles['title'] == 'Hamlet'].assign(decade = titles['year'] // 10 * 10).groupby('decade').size()

decade
1910    3
1920    1
1940    1
1950    1
1960    2
1970    2
1980    1
1990    2
2000    2
2010    3
dtype: int64

### How many leading (n=1) roles were available to actors, and how many to actresses, in each year of the 1950s?

In [6]:
cast[(cast['year'] // 10 == 195) & (cast['n'] == 1)].groupby(['year', 'type']).size()

year  type
1950  actor      626
      actress    281
1951  actor      647
      actress    281
1952  actor      607
      actress    293
1953  actor      652
      actress    301
1954  actor      634
      actress    310
1955  actor      641
      actress    281
1956  actor      643
      actress    305
1957  actor      735
      actress    301
1958  actor      710
      actress    295
1959  actor      721
      actress    317
dtype: int64

### In the 1950s taken as a whole, how many total roles were available to actors, and how many to actresses, for each "n" number 1 through 5?

In [7]:
cast[(cast['year'] // 10 == 195) & (cast['n'].between(1, 5))].groupby(['n', 'type']).size()

n    type
1.0  actor      6616
     actress    2965
2.0  actor      4564
     actress    4556
3.0  actor      5587
     actress    3148
4.0  actor      5594
     actress    2849
5.0  actor      5611
     actress    2544
dtype: int64

### Use groupby() to determine how many roles are listed for each of the Pink Panther movies.

In [9]:
cast[cast['title'].fillna('').str.contains('Pink Panther')].groupby('title').size()

title
Curse of the Pink Panther          67
Revenge of the Pink Panther        64
Son of the Pink Panther            46
The Pink Panther                  111
The Pink Panther 2                 84
The Pink Panther Strikes Again     68
The Return of the Pink Panther     30
Trail of the Pink Panther          41
dtype: int64

### List, in order by year, each of the films in which Frank Oz has played more than 1 role.

In [10]:
cast[cast['name'] == 'Frank Oz'].groupby(['title', 'year']).size().reset_index(name='count').query('count > 1').sort_values('year')

                                   title  year  count
22                      The Muppet Movie  1979      8
0         An American Werewolf in London  1981      2
20                The Great Muppet Caper  1981      6
19                      The Dark Crystal  1982      2
23            The Muppets Take Manhattan  1984      7
2                       Follow That Bird  1985      3
21            The Muppet Christmas Carol  1992      7
7                 Muppet Treasure Island  1996      4
8                     Muppets from Space  1999      4
17  The Adventures of Elmo in Grouchland  1999      3

### List each of the characters that Frank Oz has portrayed at least twice.

In [11]:
cast[cast['name'] == 'Frank Oz'].groupby('character').size().reset_index(name='count').query('count > 1')

         character  count
0           Animal      6
2             Bert      3
5   Cookie Monster      3
10     Fozzie Bear      4
15          Grover      2
18      Miss Piggy      6
25   Sam the Eagle      5
34            Yoda      6